Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Today is Wednesday.
hi: आज बुधवार है।

source: He didn't have a single pen.
hi: उसके पास एक भी पेन नहीं था।

source: Where did she go yesterday?
hi: वह कल कहाँ गयी थी?

source: She is Russian.
hi: वह रूसी है।

source: Tom is a member of the SAS.
hi: टॉम एस.ए.एस. का सदस्य है।

source: Tom lives in Wales.
hi: टॉम वेल्स में रहता है।

source: Russia is a very big country.
hi: रूस एक बहुत बड़ा देश है।

source: You can see the Empire State Building from here.
hi: आप यहां से एम्पायर स्टेट भवन देख सकते हैं।

source: What is the name of that bird?
hi: उस पंछी का नाम क्या है?

source: My foot fell asleep.
hi: मेरा पाँव सो गया.

source: I will give you a large folder.
hi: मैं तुम्हें एक बड़ा फ़ोल्डर दूँगा।

source: They have a different opinion regarding your problem.
hi: तुम्हारी समस्या के बारे में उनकी कुछ और राय है।

source: The sky is big.
hi: आकाश बड़ा है।

source: He bought a car.
hi: उसने गाड़ी खरीदी।

source: Could this be love?
hi: क्या यह प्यार हो सकता है?

source: How is it?
hi: कैसा है?

source: What was the first capital of Portugal?
hi: पुर्तगाल की पहली राजधानी क्या थी?

source: I'm studying in the library.
hi: मैं पुस्तकालय में अध्ययन कर रही हूँ ।

source: Tom refuses to work.
hi: टॉम काम करने से इनकार करता है।

source: Two hunters meet: both are dead.
hi: दो शिकारी मिलते हैं: दोनों मर गये हैं।

source: Tom burned the letter.
hi: टॉम ने वह चिट्ठी जला दी।

source: In the Cold War era, Soviet naval and air bases existed in Cuba and Vietnam.
hi: शीत युद्ध के काल में क्यूबा और वियतनाम में सोवियत नौसैनिक और वायु सेना अड्डे हुआ करते थे।

source: Tom is a communist.
hi: टॉम साम्यवादी है।

source: China has more than a billion inhabitants.
hi: चीन में एक अरब से ज़्यादा निवासी हैं।

source: The world has changed.
hi: दुनिया बदल गई है।

source: Mary loves going to the spa.
hi: मेरी को स्पा जाना पसंद है।

source: Did the police arrest Tom?
hi: पुलीस ने टॉम को गिरफ़्तार किया क्या?

source: Tom is my grandfather.
hi: टॉम मेरे दादा हैं।

source: What's today's date?
hi: आज की तारीख़ क्या है?

source: It's all over now.
hi: अब तो सब कुछ ख़तम हो चुका.

source: Do you live in Portugal or in Brazil?
hi: तुम पुर्त्तगाल में रहते हो या ब्राज़ील में?

source: Egyptian began to be written using the Greek alphabet in the 1st century.
hi: पहले शतक से मिस्री भाषा यूनानी अक्षरों में लिखी जाने लगी।

source: I became friends with him while I was in Taiwan.
hi: तैवान में रहते समय मेरी उससे दोस्ती हुई।

source: Mars is the god of war.
hi: मार्स युद्ध का देवता है।

source: Turkey is a developed country.
hi: तुर्की एक विकसित देश है।

source: India is a developing country.
hi: भारत एक विकासशील देश है।

source: Israel is a developed country.
hi: इज़राइल एक विकसित देश है।

source: Spain is a developed country.
hi: स्पेन एक विकसित देश है।

source: Are you a Taoist?
hi: तुम ताओवादी हो?

source: My wife is cooking.
hi: मेरी पत्नी पका रही है।

source: This is my song.
hi: यह मेरा गाना है।

source: He did the opposite.
hi: उसने उल्टा किया।

source: Attaboy!
hi: शाबाश!

source: This work is simple enough that even a child can do it.
hi: यह काम इतना सरल है की कोई बच्चा भी इसे कर सकता है।

source: Once upon a time they used to travel by a diligence.
hi: एक समय वे सफ़र करने में परिश्रम करते थे

source: In the past, people used to travel by a diligence.
hi: पुराने ज़माने में लोग परिश्रम से सफ़र करते थे

source: I want a pet tiger.
hi: मुझे एक पालतू शेर चाहिए।

source: Yesterday was a good day.
hi: कल अच्छा दिन था।

source: Eat your food.
hi: अपना खाना खाओ।

source: Sex sells.
hi: सेक्स बिकता है।

source: Mary showed her breasts.
hi: मैरी ने अपने स्तन दिखाएँ।

source: I like my language.
hi: मुझे मेरी भाषा पसंद है।

source: She has lived there for seven years.
hi: वह वहाँ सात साल रही है।

source: I've done nothing wrong.
hi: मैंने कुछ भी गलत नहीं किया है।

source: Today I'm online.
hi: मैं आज ऑनलाईन हूँ।

source: The train is coming.
hi: ट्रेन आ रही है।

source: I believe in Jesus Christ.
hi: मेरा यीशु मसीह में विश्वास है।

source: They're Russian.
hi: वे रूसी हैं।

source: Please show me your passport.
hi: कृपया आपका पासपोर्ट दिखाएं।

source: If you have the time, come along with me.
hi: वक़्त हो तो मेरे साथ आओ।

source: In my life I always was a liar. That's why people liked me.
hi: मैं मेरे जीवन में हमेशा से झूठा था। इसी लिए लोग मुझे पसंद करते थे।

source: I have black eyes.
hi: मेरे पास काली आँखें हैं।

source: Tom can do it in 10 minutes.
hi: टॉम १० मिनट में कर सकता है।

source: Tom extinguished his torch.
hi: टॉम ने अपना मशाल बुझाया।

source: Mary is kneeling.
hi: मैरी घुटने टेक रही है।

source: She had a flower in her hand.
hi: उसके हात में एक फूल था।

source: The student ended up sleeping in the classroom.
hi: वह छात्र कक्षा में ही सो गया।

source: "That's a woman's job," said Tom.
hi: "वह तो औरतों का काम है," टॉम ने कहा।

source: You're never at home.
hi: तुम कभी भी घर पर नहीं होते।

source: Many people in Africa speak French.
hi: आफ़्रिका में कई लोग फ़्रांसीसी बोलते हैं।

source: What is art?
hi: कला क्या होती है?

source: I like English.
hi: मुझे अंग्रेज़ी पसंद है।

source: Liar!
hi: झूठे!

source: That chicken looks good.
hi: वह मुर्गी अच्छी लग रही है।

source: I had to do everything on my own.
hi: मुझे सब कुछ खुद से करना पड़ा।

source: Natasha was born in Russia, but she doesn’t speak Russian.
hi: नताशा का जन्म रूस में हुआ था, मगर वह रूसी नहीं बोलती।

source: I am a Japanese writer.
hi: मैं जापानी लेखक हूँ।

source: Do you live in Portugal or Brazil?
hi: तुम पुर्त्तगाल में रहते हो या ब्राज़ील में?

source: Tom followed Mary.
hi: टॉमने मेरी का पीछा किया।

source: Is this where you live?
hi: यह तुम यहां रहते हो?

source: Mary stripped off her clothes.
hi: मैरी ने अपने कपड़े उतार दिये।

source: It's wrong.
hi: गलत है।

source: He who is not satisfied with a little, is satisfied with nothing.
hi: जो कम से संतुष्ट नहीं, किसी भी चीज़ से संतुष्ट नहीं है.

source: What about us?
hi: हमारा क्या?

source: Hochiminh City is the largest city in Vietnam.
hi: हो ची मिन्ह शहर वियतनाम में सबसे बड़ा शहर है।

source: Mary wears a sports bra for exercise.
hi: मैरी व्यायाम करते वक़्त स्पोर्ट्स ब्रा पहनती है।

source: Tom stayed in bed all day watching TV.
hi: टॉम पूरा दिन टीवी देखते बिस्तर पर पड़ा रहा।

source: Give me the gun.
hi: मुझे वह बंदूक दो।

source: Can you stand up?
hi: खड़े हो सकते हो?

source: You are a good person.
hi: तुम अच्छे व्यक्ति हो।

source: Books are lying about on the floor.
hi: फ़र्श पर किताबें पड़ी हुई हैं।

source: It should be fun.
hi: मज़ा आएगा।

source: I'm waiting for my boyfriend.
hi: मैं मेरे बॉयफ़्रेन्ड का इंतज़ार कर रही हूं।

source: He is Japanese.
hi: वह जापानी है।

source: Our school is in this village.
hi: हमारी पाठशाला इस गाँव में है।

source: During the Soviet Union, there were two big newspapers - "Pravda" and "Izvestiia."
hi: सोवियत संघ के दौरान दो बड़े अखबार थे - "प्रावदा" और "इज़वेस्तीया"।

source: We were friends.
hi: हम दोस्त थे।

source: Tell me your name.
hi: अपना नाम बताओ।

source: Does everybody understand?
hi: क्या सभी को समझ आता है?

source: Beryllium, magnesium, calcium, strontium, barium and radium are alkaline earth metals.
hi: विडूर, भ्राजातु, चूर्णातु, शोणातु, हर्यातु, व तेजातु क्षारीय पार्थिव धातुएँ है।

source: Have you ever read "Moby Dick"?
hi: "मोबी डिक" कभी पड़ी है?

source: They are reading her book.
hi: वे उसका किताब पढ़ रहे हैं।

source: China is larger than Japan.
hi: चीन जापान से बड़ा है।

source: Are you coming back tomorrow?
hi: क्या तुम कल लौट आ रहे हो?

source: What's the price of this?
hi: इसका दाम क्या है?

source: Ukraine became independent again when the Soviet Union dissolved in 1991.
hi: १९९१ में सोवियत संघ विघटित होने पर युक्रेन फिर स्वतंत्र हो गया।

source: It seems worthless.
hi: बेकार लगता है।

source: Is that a country or a city?
hi: वह देश है या शहर?

source: Tom raised his hairy fist.
hi: टॉम ने अपनी बालदार मुट्ठी उठाई।

source: I am used to living alone.
hi: मुझे अकेले रहने की आदत है।

source: Somebody has to talk.
hi: किसी को तो बात करनी होगी।

source: Ding is playing on the computer.
hi: डिंग कम्प्यूटर पर खेल रहा है।

source: I fucked lots of friends.
hi: मैंने कई दोस्तों को चोदा।

source: She is powerful.
hi: वह शक्तिशाली है।

source: I am from China.
hi: मैं चीन से हूँ।

source: Yesterday there was an earthquake.
hi: कल भूकंप आया था.

source: Osaka is Japan's second biggest city.
hi: ओसाका जापान का दूसरा सबसे बड़ा शहर है।

source: Will Israel attack Iran?
hi: क्या इज़राइल ईरान पर हमला करेगा?

source: Will Iran attack Israel?
hi: क्या ईरान इज़राइल पर हमला करेगा?

source: Her students study too much.
hi: उसके विद्यार्थी कुछ ज़्यादा ही पढाई करते हैं।

source: This tea is too sweet.
hi: यह चाय कुछ ज़्यादा ही मीठी है।

source: I don't like this store.
hi: मुझे यह दुकान पसंद नहीं है।

source: We both are friends.
hi: हम दोनो दोस्त है |

source: He served his king faithfully.
hi: उसने अपने राजा की वफ़ादारी से सेवा की।

source: I want to write a book.
hi: मैं एक किताब लिखना चाहता हूँ।

source: Remember these rules.
hi: इन नियमों को याद रखना।

source: Quiet!
hi: शांत!

source: The Persian Gulf is located between Iran (Persia) and the Arabian Peninsula.
hi: फारस की खाड़ी ईरान (पर्शिया) और अरबी प्रायद्वीप के बीच स्थित है।

source: There's blood in the water.
hi: पानी में खून है।

source: Again?
hi: फिर?

source: There is a church at the back of my house.
hi: मेरे घर के पीछे एक चर्च है।

source: I don't drink wine.
hi: मैं वाइन नहीं पीता।

source: Did you see that small mouse?
hi: वह छोटा चूहा देखा?

source: Kids want to play.
hi: बच्चे खेलना चाहते हैं।

source: Give me an orange.
hi: मुझे एक संत्रा दो।

source: That's the spirit!
hi: यह हुई ना बात!

source: Spain will need to borrow 100 billion euros.
hi: स्पेन को १०० अरब युरों का उधार लेना पड़ेगा।

source: I am sure that we will be very happy here.
hi: मुझे विश्वास है कि हम यहाँ अत्यंत प्रसन्न रहेंगे।

source: I'm going to teach you a lesson.
hi: मैं तुम्हें सबक सिखाने वाला हूँ।

source: It is clear that the Americans can't even solve their own problems, so how can they possibly think themselves capable of dealing with the rest of the world's problems?
hi: साफ़ है कि अमरीकी अपनी समस्याएँ भी सुलझा नहीं सकते हैं, तो फ़िर वे खुद को बाकी दुनिया की समस्याएँ सुलझाने के काबिल कैसे समझ सकते हैं?

source: Tom was spot on.
hi: टॉम बिल्कुल सही था।

source: Click on the link.
hi: लिंक पर क्लिक करो।

source: Did you find a doctor?
hi: क्या तुम्हे कोई डॉक्टर मिला?

source: What a dick!
hi: क्या लंड है!

source: It's not as easy as people think.
hi: इसे जितना लोग आसान समझते हैं उतना है नहीं।

source: She's trying to whistle, but she doesn't know how.
hi: वह सीटी बजाने की कोशिश कर रही है, मगर उसे बजाने नहीं आती।

source: There is one less.
hi: एक कम है।

source: Push!
hi: धकेलो!

source: I'm not a soldier.
hi: मैं सैनिक नहीं हूँ।

source: She cannot stop him.
hi: वह उसे रोक नहीं सकती।

source: They cannot stop us.
hi: वे हमें रोक नहीं सकते।

source: They can't stop laughing.
hi: वे हसना बंद नहीं कर सकते।

source: He can't stop us.
hi: वे हमें रोक नहीं सकते।

source: She's my friend.
hi: वह मेरी दोस्त है।

source: You're spending too much time watching TV.
hi: तुम टीवी देखने में काफ़ी समय बरबाद कर रहे हो।

source: Spain is a European country.
hi: स्पेन एक यूरोपीय देश है।

source: Romania is a Balkan country. Its capital is Bucharest.
hi: रामानिया एक बलकानी देश है। उसकी राजधानी बुखारेस्ट है।

source: I made him cry.
hi: मैने उसे रुलाया।

source: The capital city of France is Paris.
hi: फ़्रांस की राजधानी पैरीस है।

source: The apple is red.
hi: सेब लाल है।

source: Tom is reading a novel.
hi: टॉम एक उपन्यास पढ़ रहा है।

source: Tom is swimming.
hi: टॉम तैर रहा है।

source: Tom is learning English.
hi: टॉम अंग्रेज़ी सीख रहा है।

source: It's a Hindi movie.
hi: हिन्दी फ़िल्म है।

source: There are 30 students in our class.
hi: हमारी कक्षा में ३० विद्यार्थी हैं।

source: When I was at high school, I knew a lot of jokes.
hi: जब मैं उच्च विद्यालय में था तब बहुत सारे चुटकुलें जानता था।

source: I am filling this bottle with oil.
hi: मैं इस बोतल में तेल भर रहा हूँ।

source: I am lighting my cigar.
hi: मैं मेरी सिगार जला रहा हूँ।

source: I am smiling at that little girl.
hi: मैं उस लड़की को देख मुस्कुरा रहा हूँ.

source: She's helping me.
hi: वह मेरी मदत कर रही है।

source: They are reading their book.
hi: वे अपनी किताब पढ़ रहे हैं।

source: Get her out of here!
hi: उसे यहां से बाहर निकालो!

source: What are you going to do with this car?
hi: तुम इस गाड़ी के साथ क्या करने वाले हो?

source: Keep going straight through the village.
hi: गाँव में सीधे जाते रहिए।

source: Hello and how are you?
hi: नमस्ते, आप कैसे हैं?

source: Russia is the largest country in the world.
hi: रूस दुनिया का सबसे बड़ा देश है।

source: Africa is not a country.
hi: आफ़्रिका देश नहीं है।

source: I cannot make such a mistake. Russian is my native tongue.
hi: मैं ऐसी गलती नहीं कर सकता। रूसी मेरी मातृ भाषा है।

source: Checkmate.
hi: शह और मात।

source: We didn't see anything.
hi: हमें कुछ नहीं दिखा।

source: This girl is really hot.
hi: यह युवती अत्यंत आकर्षक है।

source: I'm ashamed of my body.
hi: मुझे मेरे शरीर की शरम आती है।

source: The children are riding their bikes.
hi: बच्चे अपनी साइकिलें चला रहे हैं।

source: Here they are!
hi: वे यहाँ हैं!

source: I'm sleepy. I'm going to sleep. Good night.
hi: मुझे नींद आई है। मैं सोने जा रहा हूं। गुड नाइट।

source: Barack Obama is the President of the United States.
hi: बराक ओबामा संयुक्त रोज्यों के राष्ट्रपति हैं।

source: I am connecting this computer to the Internet.
hi: मैं इस कम्प्यूटर को इंटरनेट से जोड़ रहा हूं।

source: Is it true that you learnt Esperanto in a week?
hi: क्या यह सच है कि तुम ने एस्पेरांतो एक हफ़्ते में सीखी?

source: Have you ever seen this flag?
hi: यह झंडा कभी देखा है?

source: This guy can do amazing things.
hi: यह बंदा कमाल की चीज़ें कर सकता है।

source: The clock is broken.
hi: घड़ी टूटी हुई है।

source: He was caught red handed.
hi: वह रंगे हाथों पकड़ा गया।

source: She was caught red handed.
hi: वह रंगे हाथों पकड़ी गयी।

source: Today we celebrate Africa Day.
hi: आज हम आफ़्रिका दिवस मनाते है।

source: I cannot touch fire.
hi: मैं आग को हाथ नहीं लगा सकता।

source: This is the first time I've ever worn a white coat.
hi: यह मैं पहली बार सफ़ेद रंग का कोट पहन रहा हूं।

source: Prince Charles will be the next British king.
hi: युवराज चार्ल्स अगले ब्रिटिश राजा बनेंगे।

source: He lost everything.
hi: वह सब कुछ खो बैठा।

source: Unfortunately, she lives abroad.
hi: दुर्भाग्य से, वह विदेश में रहती है।

source: I am going to that place.
hi: मैं उस जगह जा रहा हूं।

source: A cow has a long tail.
hi: गाय की लंबी पूँछ होती है।

source: My purse has been stolen.
hi: मेरा पर्स चोरी हो गया है.

source: I write letters almost every day.
hi: मैं लगभग हर रोज़ खत लिखता हूं।

source: Tell her that I am tired.
hi: उससे कहिए मैं थक गया हूँ।

source: She's playing Tetris.
hi: वह टेट्रिस खेल रही है।

source: I am like you.
hi: मैं तुम्हारे जैसा हूँ।

source: Don't let him talk to Taninna.
hi: उसे तनिन्ना से बात करने मत देना।

source: "Whose medicines are these?" "They are Fahima's."
hi: "ये किसकी दवाइयां हैं?" "फ़ाहिमा की हैं।"

source: "Whose letters are these?" "They are Linda's."
hi: "ये किसके खत हैं?" "लिंडा के।"

source: I have an erection.
hi: मेरा खड़ा है।

source: Asshole!
hi: चूतिये!

source: You have a noodle on your nose.
hi: तेरे नाक पर एक नूडल है।

source: Wait!
hi: रुको!

source: Which language do you teach?
hi: आप कौन सी भाषा सिखाते हैं?

source: The thief broke the window.
hi: चोर ने खिडकी तोड़ी।

source: I wasn't even there.
hi: मैं तो वहां थी भी नहीं.

source: They did not go there.
hi: वे वहां नहीं गए।

source: Wallonia is a beautiful country.
hi: वालोनिया एक सुंदर देश है।

source: I have seen angels and talked with them.
hi: मैंने फ़रिश्तों को देखा है, उनसे बातचीत भी की है।

source: The name of my city is Jhelum.
hi: मेरे शहर का नाम झेलम है।

source: Where is the Chinese embassy?
hi: चीनी दूतावास कहाँ है?

source: Where is the Indian embassy?
hi: भारतीय दूतावास कहाँ है?

source: Where is the Italian embassy?
hi: इतालवी दूतावास कहाँ है?

source: Where is the New Zealand embassy?
hi: न्यू ज़ीलंड का दूतावास कहां है?

source: Where is the Russian embassy?
hi: रूसी दूतावास कहाँ है?

source: Where is the Dutch embassy?
hi: डच दूतावास कहाँ है?

source: My father stayed a few days in Frankfurt.
hi: मेरे पिता फ़्रैंकफुर्ट में कुछ दिन रहें।

source: Germany is a federal state.
hi: जर्मनी एक संघीय राज्य है।

source: Who do you know in Germany?
hi: जर्मनी में आप किसे जानते हैं?

source: Where does he live in Germany?
hi: जर्मनी में वह कहाँ रहता है?

source: Tell me about Germany.
hi: मुझे जर्मनी के बारे में बताओ।

source: Is your brother still in Germany?
hi: क्या तुम्हारा भाई अभी भी जर्मनी में है?

source: Does Jasmin still live in Germany?
hi: क्या यास्मिन अभी भई जर्मनी में रहती है?

source: Whose beer is this?
hi: यह किसकी बियर है?

source: Is Germany near Italy?
hi: क्या जर्मनी इटली के नज़दीक है?

source: Germany has two capital cities.
hi: जर्मनी की दो राजधानीयां हैं।

source: This is an egg.
hi: यह मुर्गी का अंडा है।

source: Kaiser was born in Germany.
hi: काइज़र जर्मनी में जन्मा था।

source: Jasmin was born in Germany.
hi: यास्मिन जर्मनी में जन्मी थी।

source: You will like Germany.
hi: तुम्हें जर्मनी पसंद आयेगा।

source: Germany is a federal republic.
hi: जर्मनी एक संघीय गणतंत्र है।

source: I like to make Mary laugh.
hi: मुझे मैरी को हँसाना अच्छा लगता है।

source: My uncle lives in Germany.
hi: मेरे चाचा जर्मनी में रहते हैं।

source: I am gay.
hi: मैं गे हूँ।

source: This dog is gay.
hi: यह कुत्ता गे है।

source: You're gay.
hi: तुम गे हो।

source: He is gay.
hi: वह समलैंगिक है।

source: Joshua is gay.
hi: जॉशुआ गे है।

source: This is my dick.
hi: यह मेरा लंड है।

source: Laurie is reading a book now.
hi: लौरी अब एक पुस्तक पड रही है।

source: Whose tea is this?
hi: यह किसकी चाय है?

source: Damascus is in Syria.
hi: दमिश्क सीरिया में है।

source: I'm from Greece.
hi: मैं यूनान से हूँ।

source: I watch the BBC.
hi: मैं बीबीसी देखता हूँ।

source: Begin!
hi: शुरू करो!

source: My mother is a lawyer.
hi: मेरी माँ एक वकील है।

source: Are Osakans greedy?
hi: क्या ओसाकावासी लालची होते हैं?

source: I'm Azerbaijani.
hi: मैं अज़रबैजानी हूँ।

source: Does your sister live there?
hi: क्या तुम्हारी बहन वहां रहती है?

source: Why are you stuttering?
hi: हकला क्यों रहे हो?

source: She forgot to bring her swimsuit.
hi: वह अपना स्विमसूट लाना भूल गयी।

source: These are my friends.
hi: ये मेरे दोस्त हैं।

source: We're here to protect you.
hi: आपकी रक्षा करना हमारा काम है।

source: This is nothing.
hi: यह तो कुछ नहीं है।

source: She's your friend.
hi: वह तुम्हारी सहेली है।

source: Who can help you to learn German?
hi: जर्मन सीखने में तुम्हारी मदद कौन कर सकता है?

source: It is not walls that protect men but men that protect walls.
hi: दीवारें इंसानों को नहीं बचातीं, बल्कि इंसान दीवारों को बचाते हैं.

source: Do you want to go to Germany with me?
hi: क्या तुम मेरे साथ जर्मनी जाना चाहते हो?

source: Algeria is my country.
hi: अल्जीरिया मेरा देश है।

source: Algeria is situated in North Africa.
hi: एलजीरिया उत्तर आफ़्रिका में स्थित है।

source: I lost my hat on the bus.
hi: मैं बस में अपनी टोपी भूल आया।

source: Edith Piaf was a French singer.
hi: एडिथ पिआफ़ एक फ़्रांसीसी गायिका थीं।

source: Muhammad Ali was an American boxer.
hi: मुहम्मद अली एक अमेरिकी बॉक्सर थे।

source: Where are my dragons?
hi: मेरे ड्रैगन कहाँ है?

source: Kabul is Afghanistan's capital city.
hi: काबुल अफ़गानिस्तान की राजधानी है।

source: Algeria is Africa's largest country.
hi: एलजीरिया आफ़्रिका का सबसे बड़ा देश है।

source: Austria is situated in Central Europe.
hi: ऑस्ट्रिया मध्ये युरोप में स्थित है।

source: Bahrain became a kingdom in 2002.
hi: बहरीन २००२ में राज्य बना।

source: Bangladesh fought a war against Pakistan in 1971.
hi: बांग्लादेश ने पाकिस्तान के ख़िलाफ़ जंग लड़ी थी।

source: I can't live without him.
hi: मैं उसके बिना नहीं जी सकता।

source: Where could they be?
hi: वे कहां हो सकते हैं?

source: The Naxi language is spoken in China.
hi: नाशी भाषा चीन में बोली जाती है I

source: Nobody knows my country.
hi: मेरा देश कोई नहीं जानता।

source: Nobody is rich in my country.
hi: मेरे देश में कोई भी अमीर नहीं है।

source: Are you writing the proverbs?
hi: क्या तुम मुहावरें लिख रहे हो?

source: Why don't I write in Russian?
hi: मैं रूसी में क्यों नहीं लिखता?

source: Kabul is the capital of Afghanistan.
hi: काबुल अफ़गानिस्तान की राजधानी है।

source: Why do you want to learn this language?
hi: तुम यह भाषा क्यों सीखना चाहते हो?

source: You're going too fast.
hi: तुम कुछ ज़्यादा ही तेज़ जा रहे हो।

source: Speak!
hi: बोलो!

source: It wasn't him.
hi: वह नहीं था।

source: The village has no electricity.
hi: गाँव में बिजली नहीं है।

source: Look!
hi: देख!

source: Before I joined the army, I was a doctor.
hi: सेना में दाखिल होने से पहले में एक वैद्य था।

source: They are living in misery.
hi: वे विपत्ती में जी रहे हैं।

source: Scorpions are dangerous.
hi: बिच्छू खतरनाक होते हैं।

source: The food is ready.
hi: खाना तैयार है।

source: Quick!
hi: जल्दी!

source: Tom's sentences are very long.
hi: टॉम के वाक्य बहुत लंबे होते हैं।

source: She's a girl.
hi: वह लड़की है।

source: Can we save the planet?
hi: क्या हम उस ग्रह को बचा सकते हैं?

source: India is called "Bharat" in Hindi.
hi: इंडिया को हिन्दी में "भारत" कहते है।

source: France is called "France" in French.
hi: फ़्रान्स को फ़्रांसीसी में "फ़्रांस" कहते हैं।

source: Belgium is called "België" in Flemish.
hi: बेल्जियम को फ्लेमिश में "बेलख़िए" कहते हैं।

source: Spain is called "España" in Spanish.
hi: स्पेन को स्पेनिश में "एस्पान्या" कहते हैं।

source: Russia is called "Rossiya" in Russian.
hi: रूस को रूसी में "रोस्सिया" कहते है।

source: Austria is called "Österreich" in German.
hi: ऑस्ट्रिया को जर्मन में एओस्तेराइख़ कहते हैं।

source: Bhutan is called "Druk Yul" in Tibetan.
hi: भूटान को तिब्बती में "ड्रुक युल" कहते हैं।

source: Brazil is called "Brasil" in Portuguese.
hi: ब्राज़ील को पुर्त्तगाली में "ब्रासिल" कहते हैं।

source: Burma is called "Myanmar" in Burmese.
hi: बर्मा को बर्मी में "म्यानमार" कहते हैं।

source: The Dominican Republic is called "República Dominicana" in Spanish.
hi: डोमिनिकन गणराज्य को स्पेनी में "रेपुबलिका डोमिनिकाना" कहते है।

source: Egypt is called "Misr" in Arabic.
hi: मिस्र को अरबी में "मिस्र" ही कहते हैं।

source: Greece is called "Hellas" in Greek.
hi: यूनान को यूनानी में "हेल्लास" कहते है।

source: Ireland is called "Éire" in Irish Gaelic.
hi: आयरलैंड को आयरलैंड के केल्ट भाषा में "ऐर" कहते है।

source: Jerusalem is called "Yerushalayim" in Hebrew.
hi: यरुशलम को इब्रानी में "येरुशलयिम" कहते हैं।

source: Kyrgyzstan is called "Kirgiziya" in Russian.
hi: किर्गिज़स्तान को रूसी में "किर्गिज़िया" कहते है।

source: Nepal is called "Nepal" in Nepali.
hi: नेपाल को नेपाली में "नेपाल" कहते हैं।

source: Saudi Arabia is called "Al-Mamlakah Al-‘Arabiyyah As-Sa‘ūdiyyah" in Arabic.
hi: सऊदी अरब को अरबी में "अल-मामलकह अल-अरबिय्यह अस-सऊदिय्याह" कहते हैं।

source: Singapore is called "Singapura" in Malay.
hi: सिंगापुर को मलाय में "सिंगापुरा" कहते हैं।

source: Slovakia is called "Slovensko" in Slovak.
hi: स्लोवाकिया को स्लोवाक में "स्लोवेन्स्को" कहते हैं।

source: Spain is called "Espanya" in Catalan.
hi: स्पेन को कैटलन में "एस्पान्या" कहते हैं।

source: Syria is called "Suriyah" in Arabic.
hi: सीरिया को अरबी में "सुरियाह" कहते हैं।

source: Ukraine is called "Ukraina" in Ukrainian.
hi: युक्रेन को युक्रेनी में "युक्राईना" कहते हैं।

source: India is the third largest country in Asia.
hi: एशिया में तीसरा सबसे बड़ा देश भारत है।

source: Saudi Arabia is the largest country in the Arabian Peninsula.
hi: अरब प्रायद्वीप में सबसे बड़ा देश सउदी अरब है।

source: Saudi Arabia is the largest country in the Middle East.
hi: सउदी अरब मध्य पूर्व में सबसे बड़ा देश है।

source: Spain is the second largest country in Western Europe.
hi: स्पेन पश्चिमी यूरोप में दूसरा सबसे बड़ा देश है।

source: My boyfriend was crying.
hi: मेरा बॉयफ़्रेंड रो रहा था।
